package QuestionList;

/**
 * @Auther: SongYuan
 * @Date: 2019/10/14 17:21
 * @Description:
 */
public class Q1 {


    public static void main(String[] args) {
        //6、short s1 = 1; s1 = s1 + 1;有什么错? short s1 = 1; s1 += 1;有什么错?
            short s1 = 1;
            //s1 = s1 +1;      //s1是short类型，1是int类型 。byte short long类型的和int类型的数据运算的时候自动将结果转化为int类型
                                // 编译器将报告需要强制转换类型的错误
            s1 += 1;    //不存在类型转换问题 自动将1视为跟s1相同的类型
                        // +=是 java 语言规定的运算符，java 编译器会对它进行特殊处理，因此可以正确编译。

        //Int最大值:2147483647
        System.out.println("-------------------------------------需要运算的值类型是相同的------------------------------------");
        System.out.println("------------------------------------Int最大值:" + Integer.MAX_VALUE+"------------------------------------");
        System.out.println("--------------------------------Long最大值:" + Long.MAX_VALUE+"------------------------------");

//        强制类型转换： 则必须在代码中声明，转换顺序不受限制（高精度 -> 低精度转换）。 PS：此种转换存在精度损失。
//
//        自动数据类型转换：
//        自动转换按从低精度到高精度的顺序转换。不同类型数据间的优先关系如下：
//        低--------------------------------------------->高
//        byte,short,char-> int -> long -> float -> double
//
//        强转： 需要在代码中声明
//        高--------------------------------------------->低
//        double->float -> long -> int -> byte,short,char
    }


}
